Обработки/DataProcessors/_РасчетДоходностиДляРисков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_РасчетДоходностиДляРисков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуемаяБазаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетаДУ</Name>
					<Comment>Значение - СправочникСсылка.СчетаДоверительногоУправления</Comment>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодКлиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПростаяГодоваяДоходность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭффективнаяГодоваяДоходность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьАктивовНаНачало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьАктивовНаКонец</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейВПериоде</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяДоходность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаГарантированногоДохода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаОпераций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВыводЦенныхБумаг</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыводДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ВключениеПрочегоИмуществаВСоставПИФ</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыводКредитногоИнструмента</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводКредитногоИнструмента</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейВУправлении</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Обработки/DataProcessors/_РасчетДоходностиДляРисков/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//	Вид (Строка) - вид подключаемого объекта:
//		|- "ДополнительнаяОбработка"
//		|- "ДополнительныйОтчет"
//		|- "ЗаполнениеОбъекта"
//		|- "ПечатнаяФорма"
//
//	Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//		Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//	Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//	Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//	Информация (Строка) - описание обработки
//
//	Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//		|- Представление (строка) - представление команды конечному пользователю
//		|- Идентификатор (строка) - идентификатор команды
//		|- Использование (строка) - варианты запуска обработки:
//		|	|- "ОткрытиеФормы"          - открыть форму обработки
//		|	|- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//		|	|- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//		|- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//		|	Прим. Имеет смысл только при запуске обработки без открытия формы.
//		|- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//		Печать требуется установить как "ПечатьMXL"
Функция СведенияОВнешнейОбработке() Экспорт
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Расчёт доходности для рисков",
		"1.3.12",
		"",
		Истина
	);
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды,
		"ВыгрузитьВSQL", "Выгрузка в SQL",, Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
КонецФункции

// Интерфейс для запуска обработки
//
// Параметры:
//	ИдентификаторКоманды (строка)  - идентификатор команды
//	ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//		элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	// Параметры команды
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(
		ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	// Установка некоторых реквизитов объекта заранее
	ЭтотОбъект.ИспользуемаяБазаДанных = "Рабочая";
	// Запуск команды
	Если ИдентификаторКоманды = "ВыгрузитьВSQL" Тогда
		ВыгрузитьВSQL(ПараметрыКоманды);
	КонецЕсли;
КонецПроцедуры

#Область КомандыДополнительныхОтчетовИОбработок

Процедура ВыгрузитьВSQL(ПараметрыКоманды)
	КалендарьТорговыхДней = Неопределено;
	// Параметры команды: Организация
	Если ПараметрыКоманды.Свойство("Организация") И ЗначениеЗаполнено(ПараметрыКоманды.Организация) Тогда
		ЭтотОбъект.Организация = ПараметрыКоманды.Организация;
	Иначе
		ВызватьИсключение "Не заполнен параметр ""Организация"".";
	КонецЕсли;
	// Параметры команды: Дата окончания
	ЭтотОбъект.ДатаОкончания = Неопределено;
	Если ПараметрыКоманды.Свойство("ДатаОкончания") Тогда
		ЭтотОбъект.ДатаОкончания = ПараметрыКоманды.ДатаОкончания;
	КонецЕсли;
	// Параметры команды: Дата начала
	ЭтотОбъект.ДатаНачала = Неопределено;
	Если ПараметрыКоманды.Свойство("ДатаНачала") Тогда
		ЭтотОбъект.ДатаНачала = ПараметрыКоманды.ДатаНачала;
	КонецЕсли;
	// Параметры команды: Дата окончания (дополнительно)
	Если ЭтотОбъект.ДатаОкончания = Неопределено Или ЭтотОбъект.ДатаОкончания = Дата(1, 1, 1) Тогда
		ЭтотОбъект.ДатаОкончания = ТекущаяДата();
	КонецЕсли;
	// Параметры команды: Дата начала (дополнительно)
	Если ЭтотОбъект.ДатаНачала = Неопределено Или ЭтотОбъект.ДатаНачала = Дата(1, 1, 1) Тогда
		ЭтотОбъект.ДатаНачала = НачалоГода(ЭтотОбъект.ДатаОкончания);
	КонецЕсли;
	// Параметры команды: Сдвиг в торговых днях
	Если ПараметрыКоманды.Свойство("СдвигВТорговыхДнях") Тогда // 0 - сегодня, 1 - прошлый торговый день, 2 - позапрошлый торговый день и т.д.
		СдвигВТорговыхДнях = ПараметрыКоманды.СдвигВТорговыхДнях;
		Если СдвигВТорговыхДнях > 0 Тогда
			Если КалендарьТорговыхДней = Неопределено Тогда
				КалендарьТорговыхДней = ОбщегоНазначения.ПолучитьИменованныйОбъект("КалендарьКотировок");
			КонецЕсли;
			ДатаОкончанияСоСдвигом = Справочники.Календари.ДобавитьКДатеРабочиеДни(КалендарьТорговыхДней, ЭтотОбъект.ДатаОкончания, -(СдвигВТорговыхДнях + 1));
			Если ДатаОкончанияСоСдвигом <> Неопределено Тогда
				ЭтотОбъект.ДатаОкончания = ДатаОкончанияСоСдвигом;
			Иначе
				Сообщить("Не удалось получить торговый день при сдвиге (" + ЭтотОбъект.ДатаОкончания + ") на (" + СдвигВТорговыхДнях + ") торговых дня назад.");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Параметры команды: Вид выгрузки
	Если ПараметрыКоманды.Свойство("ВидВыгрузки") Тогда
		ВидВыгрузки = ПараметрыКоманды.ВидВыгрузки; // "ЕжемесячнаяВыгрузка"
		// Вид выгрузки: Ежемесячная выгрузка
		//	Дата начала - начало года даты окончания
		//	Дата окончания - последний торговый день прошлого месяца
		Если ВидВыгрузки = "ЕжемесячнаяВыгрузка" Тогда
			Если КалендарьТорговыхДней = Неопределено Тогда
				КалендарьТорговыхДней = ОбщегоНазначения.ПолучитьИменованныйОбъект("КалендарьКотировок");
			КонецЕсли;
			КонецПрошлогоМесяца = КонецМесяца(ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1));
			ПоследнийТорговыйДеньПрошлогоМесяца = Справочники.Календари.ДобавитьКДатеРабочиеДни(КалендарьТорговыхДней, КонецПрошлогоМесяца, -1);
			ЭтотОбъект.ДатаОкончания = ПоследнийТорговыйДеньПрошлогоМесяца;
			ЭтотОбъект.ДатаНачала = НачалоГода(ЭтотОбъект.ДатаОкончания);
		Иначе
			ВызватьИсключение "Неизвестный вид выгрузки у параметра ""ВидВыгрузки"": " + ВидВыгрузки + ".";
		КонецЕсли;
	КонецЕсли;
	// Параметры команды: Коды клиентов
	Если ПараметрыКоманды.Свойство("КодыКлиентов") Тогда
		// Один текстовый параметр может не вместить всю строку клиентов через запятую
		КодыКлиентов = СтрРазделить(ПараметрыКоманды.КодыКлиентов, ",", Ложь);
		КодыКлиентовДоп1 = Новый Массив;
		Если ПараметрыКоманды.Свойство("КодыКлиентовДоп1") Тогда
			КодыКлиентовДоп1 = СтрРазделить(ПараметрыКоманды.КодыКлиентовДоп1, ",", Ложь);
		КонецЕсли;
		КодыКлиентовДоп2 = Новый Массив;
		Если ПараметрыКоманды.Свойство("КодыКлиентовДоп2") Тогда
			КодыКлиентовДоп2 = СтрРазделить(ПараметрыКоманды.КодыКлиентовДоп2, ",", Ложь);
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СчетаДоверительногоУправления.Ссылка КАК СчетДУ
			|ИЗ
			|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
			|ГДЕ
			|	СчетаДоверительногоУправления.КодСчета В(&КодыКлиентов)
			|	ИЛИ СчетаДоверительногоУправления.КодСчета В(&КодыКлиентовДоп1)
			|	ИЛИ СчетаДоверительногоУправления.КодСчета В(&КодыКлиентовДоп2)";
		Запрос.УстановитьПараметр("КодыКлиентов", КодыКлиентов);
		Запрос.УстановитьПараметр("КодыКлиентовДоп1", КодыКлиентовДоп1);
		Запрос.УстановитьПараметр("КодыКлиентовДоп2", КодыКлиентовДоп2);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЭтотОбъект.СчетаДУ.Добавить(Выборка.СчетДУ);
		КонецЦикла;
	КонецЕсли;
	// Выполнение команды
	УстановитьПараметрыСоединенияСSQL();
	ЗаполнитьПоТекущимПараметрам();
	КоличествоОбработанныхЗаписей = ВыгрузитьДанныеВSQL();
	Сообщить("Выгрузка успешно завершена. Выгружено строк: " + КоличествоОбработанныхЗаписей);
КонецПроцедуры

#КонецОбласти

Процедура УстановитьПараметрыСоединенияСSQL() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	// Получение параметров соединения
	ПараметрыСоединения = ВнешниеИсточникиДанных.RiskControl.ПолучитьОбщиеПараметрыСоединения();
	// Изменение строки соединения
	Если ЭтотОбъект.ИспользуемаяБазаДанных = "Рабочая" Тогда
		ПараметрыСоединения.СтрокаСоединения = "Driver={SQL Server};Server=AP18.G1.LAN;Database=ais_warehouse;SCHEMA=AM;";
	ИначеЕсли ЭтотОбъект.ИспользуемаяБазаДанных = "Тестовая" Тогда
		ПараметрыСоединения.СтрокаСоединения = "Driver={SQL Server};Server=AP18.G1.LAN;Database=ais_warehouse_dev;SCHEMA=AM;";
	Иначе
		ВызватьИсключение "Неизвестный вариант используемой базы данных";
	КонецЕсли;
	// Сохранение параметров соединения
	ВнешниеИсточникиДанных.RiskControl.УстановитьПараметрыСоединенияСеанса(ПараметрыСоединения);
	ВнешниеИсточникиДанных.RiskControl.УстановитьСоединение();
КонецПроцедуры

Процедура ЗаполнитьПоТекущимПараметрам() Экспорт
	// Предварительная очистка таблиц
	ЭтотОбъект.ТаблицаДанных.Очистить();
	ЭтотОбъект.ТаблицаОпераций.Очистить();
	// Начало сессии статистики
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + "." + "ЗаполнитьПоТекущимПараметрам";
	ПараметрыВыполнения = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект,,);
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполнения.Хранилище, ПараметрыВыполнения.Описание);
	// Получение и заполнение достигнутых доходностей
	ДанныеДостигнутойДоходности = ПолучитьДанныеДостигнутойДоходности(
		ЭтотОбъект.Организация, ЭтотОбъект.СчетаДУ.ВыгрузитьЗначения(), ЭтотОбъект.ДатаНачала, ЭтотОбъект.ДатаОкончания);
	Для Каждого СтрокаДостигнутойДоходности Из ДанныеДостигнутойДоходности Цикл
		СтрокаДанных = ЭтотОбъект.ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаДостигнутойДоходности);
		Для Каждого ТекущаяОперация Из СтрокаДостигнутойДоходности.Операции Цикл
			СтрокаОпераций = ЭтотОбъект.ТаблицаОпераций.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОпераций, ТекущаяОперация);
			СтрокаОпераций.СчетДоверительногоУправления = СтрокаДанных.СчетДоверительногоУправления;
		КонецЦикла;
	КонецЦикла;
	// Расчёт и заполнение ставки гарантированного дохода
	СтавкаГарантированногоДоходаПоСчетуДУ = ПолучитьСтавкиГарантированногоДохода(СчетаДУ.ВыгрузитьЗначения(), ДатаОкончания);
	Для Каждого СтрокаДанных Из ЭтотОбъект.ТаблицаДанных Цикл
		НайденнаяСтавкаГарантированногоДохода = СтавкаГарантированногоДоходаПоСчетуДУ.Получить(СтрокаДанных.СчетДоверительногоУправления);
		Если НайденнаяСтавкаГарантированногоДохода = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДанных.СтавкаГарантированногоДохода = НайденнаяСтавкаГарантированногоДохода;
	КонецЦикла;
	// Окончание сессии статистики
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
КонецПроцедуры

// Получение данных о достигнутой доходности
//
// Параметры:
//	Организация - СправочникСсылка.Организации,
//	СчетаДУ - Массив(СправочникСсылка.СчетаДоверительногоУправления),
//	ДатаНачала - Дата,
//	ДатаОкончания - Дата
//
// Возвращаемое значение:
//	Массив(Структура(
//		СчетДоверительногоУправления - СправочникСсылка.СчетаДоверительногоУправления,
//		СтоимостьАктивовНаНачало - Число,
//		СтоимостьАктивовНаКонец - Число,
//		КоличествоДнейВПериоде - Число,
//		Доходность - Число,
//		КодКлиента - Строка,
//		АбсолютнаяДоходность - Число,
//		ЭффективнаяГодоваяДоходность - Число,
//		СтавкаГарантированногоДохода - Число,
//		Операции - Массив(Структура(
//			Период - Дата,
//			Операция - Регистратор РегистрыНакопления.ВводыВыводыАктивовВВалютеУчета,
//			Валюта - СправочникСсылка.Валюты,
//			Сумма - Число,
//			ДнейВУправлении - Число,
//			Комментарий - Строка
//		))
//	))
Функция ПолучитьДанныеДостигнутойДоходности(Организация, СчетаДУ, ДатаНачала, ДатаОкончания) Экспорт
	МассивСтруктур = Новый Массив; // Возвращаемое значение
	
	МассивОшибок = Новый Массив;
	ПараметрыРасчетаДоходности = Новый Структура;
	ПараметрыРасчетаДоходности.Вставить("Организация", Организация);
	ПараметрыРасчетаДоходности.Вставить("ДатаНачала", ДатаНачала);
	ПараметрыРасчетаДоходности.Вставить("ДатаОкончания", ДатаОкончания);
	ПараметрыРасчетаДоходности.Вставить("УчитыватьНДФЛПоНачислению", Истина);
	ПараметрыРасчетаДоходности.Вставить("РасшифровкаРасчета", Истина);
	ПараметрыРасчетаДоходности.Вставить("МассивОшибок", МассивОшибок);
	//ПараметрыРасчетаДоходности.Вставить("ВалютаРасчета", Справочники.Валюты.ПустаяСсылка());
	
	// Расчёт доходности управления
	Для Каждого СчетДУ Из СчетаДУ Цикл
		МассивОшибок.Очистить(); // Очищать массив нужно перед каждый новым запуском расчёта доходности управления
		ПараметрыРасчетаДоходности.Вставить("СчетДоверительногоУправления", СчетДУ);
		ДоходностьУправления = Документы.РегистрацияСтоимостиАктивов.РассчитатьДоходностьУправления(ПараметрыРасчетаДоходности);
		// Вывод ошибок
		Если МассивОшибок.Количество() > 0 Тогда
			Сообщить("Произошло (" + МассивОшибок.Количество() + ") ошибок во время вычисления доходности управления:");
			Для Каждого СтрокаОшибок Из МассивОшибок Цикл
				Сообщить("- " + СтрокаОшибок);
			КонецЦикла;
		КонецЕсли;
		СтруктураДанных = Новый Структура(
			"СчетДоверительногоУправления, СтоимостьАктивовНаНачало, СтоимостьАктивовНаКонец, КоличествоДнейВПериоде, ПростаяГодоваяДоходность,
			|КодКлиента, АбсолютнаяДоходность, ЭффективнаяГодоваяДоходность, СтавкаГарантированногоДохода, Операции");
		МассивСтруктур.Добавить(СтруктураДанных);
		// Полученные значения
		СтруктураДанных.СчетДоверительногоУправления = ДоходностьУправления.СчетДоверительногоУправления;
		СтруктураДанных.СтоимостьАктивовНаНачало = ДоходностьУправления.СтоимостьАктивовНаНачало;
		СтруктураДанных.СтоимостьАктивовНаКонец = ДоходностьУправления.СтоимостьАктивовНаКонец;
		СтруктураДанных.КоличествоДнейВПериоде = ДоходностьУправления.КоличествоДнейВПериоде;
		СтруктураДанных.ПростаяГодоваяДоходность = ДоходностьУправления.Доходность;
		// Дополнительные значения
		Если ЗначениеЗаполнено(СтруктураДанных.СчетДоверительногоУправления) Тогда
			СтруктураДанных.КодКлиента = СтруктураДанных.СчетДоверительногоУправления.КодСчета;
		КонецЕсли;
		КоличествоИспользуемыхЛетПериода = Год(ДатаОкончания) - Год(ДатаНачала) + 1;
		Если КоличествоИспользуемыхЛетПериода < 1 Тогда
			КоличествоИспользуемыхЛетПериода = 1;
		КонецЕсли;
		КоличествоКалендарныхДнейВГодыПериода = (НачалоДня(КонецГода(ДатаОкончания)) - НачалоГода(ДатаНачала)) / (60 * 60 * 24) + 1;
		СреднееКоличествоДнейВГодуПериода = КоличествоКалендарныхДнейВГодыПериода / КоличествоИспользуемыхЛетПериода;
		ПростаяГодоваяДоходностьДоля = ДоходностьУправления.Доходность / 100.;
		АбсолютнаяДоходностьДоля = ПростаяГодоваяДоходностьДоля * СтруктураДанных.КоличествоДнейВПериоде / СреднееКоличествоДнейВГодуПериода;
		Если АбсолютнаяДоходностьДоля < -1 Тогда
			АбсолютнаяДоходностьДоля = -1;
		КонецЕсли;
		СтруктураДанных.АбсолютнаяДоходность = АбсолютнаяДоходностьДоля * 100.;
		ЭффективнаяГодоваяДоходностьДоля = 0;
		Если СтруктураДанных.КоличествоДнейВПериоде > 0 Тогда
			ЭффективнаяГодоваяДоходностьДоля = Pow(АбсолютнаяДоходностьДоля + 1, СреднееКоличествоДнейВГодуПериода / СтруктураДанных.КоличествоДнейВПериоде) - 1;
		КонецЕсли;
		СтруктураДанных.ЭффективнаяГодоваяДоходность = ЭффективнаяГодоваяДоходностьДоля * 100.;
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ДоходностьУправления);
		// Операции
		СтруктураДанных.Операции = Новый Массив;
		Для Каждого ТекущаяОперация Из ДоходностьУправления.Операции Цикл
			СтруктураОперации = Новый Структура("Период, Операция, Валюта, Сумма, ДнейВУправлении, Комментарий");
			ЗаполнитьЗначенияСвойств(СтруктураОперации, ТекущаяОперация);
			СтруктураДанных.Операции.Добавить(СтруктураОперации);
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивСтруктур;
КонецФункции

// Изменённая функция "ПолучитьТаблицуНастроекВознагражденияСГарантированнымДоходом" из доп. обработки "Расчёт доходности ДУ":
//	ВидыДоговоров заменены на СчетаДУ;
//	ДатаОкончания изменена на ДатаРасчета;
//	Возвращается не ТаблицаЗначений, а Соответствие.
//
// Возвращаемое значение:
//	Соответствие(СправочникСсылка.СчетаДоверительногоУправления, Структура(
//		БазаРасчета: СправочникСсылка.БазыРасчета,
//		Периодичность: ПеречислениеСсылка.ПериодичностьРасчетаВознагражденияУправляющего
//		НастройкаРасчета: СправочникСсылка.НастройкиРасчета
//		СтавкаГарантированногоДохода: Число(19, 2)
//	))
Функция ПолучитьСтавкиГарантированногоДохода(СчетаДУ, ДатаРасчета) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	НастройкиРасчетаВознагражденияУправляющегоСрезПоследних.НастройкаРасчета КАК НастройкаРасчета,
		|	НастройкиРасчетаСоставляющие.БазаРасчета КАК БазаРасчета,
		|	НастройкиРасчетаСоставляющие.Периодичность КАК Периодичность,
		|	НастройкиРасчетаСоставляющие.ПараметрыРасчета КАК ПараметрыРасчета
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиРасчетаВознагражденияУправляющего.СрезПоследних(
		|				&ДатаРасчета,
		|				Организация = &Организация
		|					И ВидВознаграждения = ЗНАЧЕНИЕ(Перечисление.ВидыВознагражденийУправляющего.ВознаграждениеУправляющего)
		|		) КАК НастройкиРасчетаВознагражденияУправляющегоСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиРасчета.Составляющие КАК НастройкиРасчетаСоставляющие
		|			ПО НастройкиРасчетаВознагражденияУправляющегоСрезПоследних.НастройкаРасчета = НастройкиРасчетаСоставляющие.Ссылка
		|				И (НастройкиРасчетаСоставляющие.НомерСтроки = 1)
		|		ПО (НастройкиРасчетаВознагражденияУправляющегоСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.Ссылка В(&СчетаДУ)
		|	И (СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаРасчета
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаРасчета";
	#КонецОбласти
	Запрос.УстановитьПараметр("Организация" , ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетаДУ", СчетаДУ);
	Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Соответствие; // Возвращаемое значение
	Пока Выборка.Следующий() Цикл
		ЗначениеРезультата = Новый Структура("НастройкаРасчета, БазаРасчета, Периодичность, СтавкаГарантированногоДохода");
		Результат.Вставить(Выборка.СчетДоверительногоУправления, ЗначениеРезультата);
		ЗаполнитьЗначенияСвойств(ЗначениеРезультата, Выборка);
		Если ЗначениеЗаполнено(Выборка.ПараметрыРасчета) Тогда
			ПараметрыРасчета = Выборка.ПараметрыРасчета.Получить();
			Если ПараметрыРасчета.Свойство("ПараметрРасчетаСтавкаГД") Тогда
				ЗначениеРезультата.СтавкаГарантированногоДохода = ПараметрыРасчета.ПараметрРасчетаСтавкаГД;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

// Выгрузка данных в SQL
//
// Возвращаемое значение:
//	Число - Количество обработанных записей
Функция ВыгрузитьДанныеВSQL() Экспорт
	// Начало сессии статистики
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + "." + "ВыгрузитьДанныеВSQL";
	ПараметрыВыполнения = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект,,);
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполнения.Хранилище, ПараметрыВыполнения.Описание);
	// Проверка корректности параметров
	КоличествоОбработанныхЗаписей = 0;
	МенеджерЗаписи = ВнешниеИсточникиДанных.RiskControl.Таблицы.T_Portfolio_Returns.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.StartDate = ЭтотОбъект.ДатаНачала;
	МенеджерЗаписи.EndDate = ЭтотОбъект.ДатаОкончания;
	Для Каждого СтрокаДанных Из ЭтотОбъект.ТаблицаДанных Цикл
		МенеджерЗаписи.ClientCode = СтрокаДанных.КодКлиента;
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.ClientCode) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураИзмерений = Новый Структура("ClientCode, StartDate, EndDate");
		ЗаполнитьЗначенияСвойств(СтруктураИзмерений, МенеджерЗаписи);
		МенеджерЗаписи.Прочитать();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураИзмерений);
		МенеджерЗаписи.StartNetAssetValue = СтрокаДанных.СтоимостьАктивовНаНачало;
		МенеджерЗаписи.EndNetAssetValue = СтрокаДанных.СтоимостьАктивовНаКонец;
		МенеджерЗаписи.TimeWeightedReturn = СтрокаДанных.АбсолютнаяДоходность;
		МенеджерЗаписи.SimpleAnnualReturn = СтрокаДанных.ПростаяГодоваяДоходность;
		МенеджерЗаписи.CompoundAnnualGrowthRate = СтрокаДанных.ЭффективнаяГодоваяДоходность;
		МенеджерЗаписи.GuaranteedReturn = СтрокаДанных.СтавкаГарантированногоДохода;
		//МенеджерЗаписи.GuaranteedAssetValue = 0;
		МенеджерЗаписи.Записать(Истина);
		КоличествоОбработанныхЗаписей = КоличествоОбработанныхЗаписей + 1;
	КонецЦикла;
	// Окончание сессии статистики
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	Возврат КоличествоОбработанныхЗаписей;
КонецФункции

#Область ПодсказкиДляРасчётаОбязательствПередКлиентом
// ВЫРАЗИТЬ(((ВТ_СЧА_НаНачало.СЧА - ВТ_СЧА_НаНачало.ЗадолженностьНДФЛ) * _СчетаДУ.ДнейВГоду
//	+ ЕСТЬNULL(ВводыВыводы.ДляСреднегоЗаГод, 0)) / _СчетаДУ.ДнейВГоду КАК ЧИСЛО(19, 2)) КАК СредняяСтоимостьИмуществаЗаГод,

//	ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот * ВЫБОР
//		КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
//			ТОГДА 1
//		КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
//			ТОГДА -1
//	КОНЕЦ * (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВводыВыводыАктивовВВалютеУчетаОбороты.Период, ДЕНЬ), КОНЕЦПЕРИОДА(&ДатаОкончания, ГОД), ДЕНЬ) + 1)
//		* КурсыВалют.Кратность / КурсыВалют.Курс КАК ДляСреднегоЗаГод,
#КонецОбласти
